stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_hal_pwr.h
/**
  ******************************************************************************
  * @file    stm32wl3x_hal_pwr.h
  * @author  MCD Application Team
  * @brief   Header file of PWR HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32WL3x_HAL_PWR_H
#define STM32WL3x_HAL_PWR_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wl3x_hal_def.h"
#include "stm32wl3x_ll_pwr.h"

/** @addtogroup STM32WL3x_HAL_Driver
  * @{
  */

/** @defgroup PWR PWR
  * @brief PWR HAL module driver
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup PWR_Exported_Types PWR Exported Types
  * @{
  */

/**
  * @brief  PWR PVD configuration structure definition
  */
typedef struct
{
  uint32_t PVDLevel;       /*!< PVDLevel: Specifies the PVD detection level.
                                This parameter can be a value of @ref PWR_PVD_Detection_Level. */

  uint32_t Mode;           /*!< Mode: Specifies the operating mode for the selected pins.
                                This parameter can be a value of @ref PWR_PVD_Mode. */
} PWR_PVDTypeDef;

/**
  * @brief  PWR DEEPSTOP configuration structure definition
  */
typedef struct
{
  uint32_t deepStopMode; /*!< Specifies the configuration of the slow clock in DEEPSTOP.
                          This parameter can be one of the following value:
                          - PWR_DEEPSTOP_WITH_SLOW_CLOCK_OFF
                          - PWR_DEEPSTOP_WITH_SLOW_CLOCK_ON */

} PWR_DEEPSTOPTypeDef;

/**
  * @brief  PWR ULTRA DEEPSTOP configuration structure definition
  * @note This mode is available only for STM32WL3RX device.
  * @note The wake up source can be occurred by the following
          pins: PB0, PA0, PA7, PA8, PA9, and PA11.

  */
typedef struct
{
  uint8_t BORStatus;       /*!< Specifies the BOR status ENABLE or DISABLE */
  uint8_t WakeUpPinStatus; /*!< Specifies if the wake up source
                                is ENABLE or DISABLE*/
  uint8_t WakeUpPol;       /*!< Specifies the wake up source polarity */

} PWR_ULTRA_DEEPSTOPTypeDef;

/**
  * @brief  PWR SHUTDOWN configuration structure definition
  * @note For STM32WL3RX device: the wake up source can be occurred
          by the following pins: PB0, PA0, PA7, PA8, PA9, and PA11.
  * @note For STM32WL3XX device: the wake up source can be occurred
          by PB0 pin.

  */
typedef struct
{
  uint8_t BORStatus;       /*!< Specifies the BOR status ENABLE or DISABLE */
  uint8_t WakeUpPinStatus; /*!< Specifies if the wake up source
                                is ENABLE or DISABLE*/
  uint8_t WakeUpPol;       /*!< Specifies the wake up source polarity */

} PWR_SHUTDOWNTypeDef;

/**
  * @brief  PWR SAVE enum definition
  */
typedef enum
{
  POWER_SAVE_LEVEL_DISABLED          = 0,
  POWER_SAVE_LEVEL_SLEEP             = 1,
  POWER_SAVE_LEVEL_DEEPSTOP_TIMER    = 2,
  POWER_SAVE_LEVEL_DEEPSTOP_NOTIMER  = 3,
#if defined(STM32WL3RX)
  POWER_SAVE_LEVEL_ULTRADEEPSTOP     = 4,
#endif
} PowerSaveLevels;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup PWR_Exported_Constants PWR Exported Constants
  * @{
  */

/** @defgroup PWR_PVD_Detection_Level  Power Voltage Detector Level selection
  * @note     Refer datasheet for selection voltage value
  * @{
  */
#define PWR_PVDLEVEL_0                  (0x00000000U)                         /*!< PVD threshold around 2.05 V */
#define PWR_PVDLEVEL_1                  (PWR_CR2_PVDLS_0)                     /*!< PVD threshold around 2.20 V */
#define PWR_PVDLEVEL_2                  (PWR_CR2_PVDLS_1)                     /*!< PVD threshold around 2.36 V */
#define PWR_PVDLEVEL_3                  (PWR_CR2_PVDLS_1 | PWR_CR2_PVDLS_0)   /*!< PVD threshold around 2.52 V */
#define PWR_PVDLEVEL_4                  (PWR_CR2_PVDLS_2)                     /*!< PVD threshold around 2.64 V */
#define PWR_PVDLEVEL_5                  (PWR_CR2_PVDLS_2 | PWR_CR2_PVDLS_0)   /*!< PVD threshold around 2.81 V */
#define PWR_PVDLEVEL_6                  (PWR_CR2_PVDLS_2 | PWR_CR2_PVDLS_1)   /*!< PVD threshold around 2.91 V */
#define PWR_PVDLEVEL_7                  (PWR_CR2_PVDLS)                       /*!< External input analog voltage (compared internally to VREFINT for BlueNRG-LP and LPS.  Compared internally to VBGP for STM32WL33) */
/**
  * @}
  */

/** @defgroup PWR_PVD_Mode  PWR PVD interrupt and event mode
  * @{
  */
#define PWR_PVD_MODE_NORMAL                 (0x00000000U)                  /*!< Basic mode is used */
#define PWR_PVD_MODE_IT                     (SYSCFG_PWRC_IER_PVD_IE)       /*!< Interrupt Mode detection */
/**
  * @}
  */

/** @defgroup PWR_Flags PWR Flags
  * @{
  */
/*--------------------------------IWUF-------------------------------*/
#define PWR_FLAG_LPUART       0x00000000U
#define PWR_FLAG_RTC          0x00000001U
#define PWR_FLAG_LCD          0x00000002U
#define PWR_FLAG_COMP         0x00000003U
#define PWR_FLAG_LCSC         0x00000004U
#define PWR_FLAG_MRSUBG       0x00000005U
#define PWR_FLAG_MRSUBGHCPU   0x00000006U
#define PWR_FLAG_LPAWUR       0x00000007U

/*--------------------------------SR2--------------------------------*/
#define PWR_FLAG_SMPSBYPR     0x00000008U
#define PWR_FLAG_SMPSENR      0x00000009U
#define PWR_FLAG_SMPSRDY      0x0000000AU
#define PWR_FLAG_REGLPS       0x0000000BU
#define PWR_FLAG_REGMS        0x0000000CU
#define PWR_FLAG_PVDO         0x0000000DU

/*--------------------------------WUFA--------------------------------*/
#define PWR_FLAG_WUFA0        0x0000000EU
#define PWR_FLAG_WUFA1        0x0000000FU
#define PWR_FLAG_WUFA2        0x00000010U
#define PWR_FLAG_WUFA3        0x00000011U
#define PWR_FLAG_WUFA4        0x00000012U
#define PWR_FLAG_WUFA5        0x00000013U
#define PWR_FLAG_WUFA6        0x00000014U
#define PWR_FLAG_WUFA7        0x00000015U
#define PWR_FLAG_WUFA8        0x00000016U
#define PWR_FLAG_WUFA9        0x00000017U
#define PWR_FLAG_WUFA10       0x00000018U
#define PWR_FLAG_WUFA11       0x00000019U
#define PWR_FLAG_WUFA12       0x0000001AU
#define PWR_FLAG_WUFA13       0x0000001BU
#define PWR_FLAG_WUFA14       0x0000001CU
#define PWR_FLAG_WUFA15       0x0000001DU
#define PWR_FLAG_WUFA_ALL     0x0000FFFFU

/*--------------------------------WUFB--------------------------------*/
#define PWR_FLAG_WUFB0        0x0000001EU
#define PWR_FLAG_WUFB1        0x0000001FU
#define PWR_FLAG_WUFB2        0x00000020U
#define PWR_FLAG_WUFB3        0x00000021U
#define PWR_FLAG_WUFB4        0x00000022U
#define PWR_FLAG_WUFB5        0x00000023U
#define PWR_FLAG_WUFB6        0x00000024U
#define PWR_FLAG_WUFB7        0x00000025U
#define PWR_FLAG_WUFB8        0x00000026U
#define PWR_FLAG_WUFB9        0x00000027U
#define PWR_FLAG_WUFB10       0x00000028U
#define PWR_FLAG_WUFB11       0x00000029U
#define PWR_FLAG_WUFB12       0x0000002AU
#define PWR_FLAG_WUFB13       0x0000002BU
#define PWR_FLAG_WUFB14       0x0000002CU
#define PWR_FLAG_WUFB15       0x0000002DU
#define PWR_FLAG_WUFB_ALL     0xFFFF0000U
#define PWR_FLAG_WUF_ALL      (PWR_FLAG_WUFA_ALL | PWR_FLAG_WUFB_ALL)

/*--------------------------------SDWN_WUF----------------------------*/
#define PWR_FLAG_WUF          0x0000002EU

/*--------------------------------EXTSRR------------------------------*/
#define PWR_FLAG_DEEPSTOPF    0x00000030U
#define PWR_FLAG_RFPHASEF     0x00000031U

/**
  * @}
  */

/** @defgroup PWR_WAKEUP_SOURCE Wakeup Source
  * @{
  */
#define PWR_WAKEUP_ALL           0x0000FFFF               /*!< Enable all the wakeup source                    */
#define PWR_WAKEUP_PIN0          (uint32_t)(1U << 0U)     /*!< Enable the wakeup source IO0                    */
#define PWR_WAKEUP_PIN1          (uint32_t)(1U << 1U)     /*!< Enable the wakeup source IO1                    */
#define PWR_WAKEUP_PIN2          (uint32_t)(1U << 2U)     /*!< Enable the wakeup source IO2                    */
#define PWR_WAKEUP_PIN3          (uint32_t)(1U << 3U)     /*!< Enable the wakeup source IO3                    */
#define PWR_WAKEUP_PIN4          (uint32_t)(1U << 4U)     /*!< Enable the wakeup source IO4                    */
#define PWR_WAKEUP_PIN5          (uint32_t)(1U << 5U)     /*!< Enable the wakeup source IO5                    */
#define PWR_WAKEUP_PIN6          (uint32_t)(1U << 6U)     /*!< Enable the wakeup source IO6                    */
#define PWR_WAKEUP_PIN7          (uint32_t)(1U << 7U)     /*!< Enable the wakeup source IO7                    */
#define PWR_WAKEUP_PIN8          (uint32_t)(1U << 8U)     /*!< Enable the wakeup source IO8                    */
#define PWR_WAKEUP_PIN9          (uint32_t)(1U << 9U)     /*!< Enable the wakeup source IO9                    */
#define PWR_WAKEUP_PIN10         (uint32_t)(1U << 10U)    /*!< Enable the wakeup source IO10                   */
#define PWR_WAKEUP_PIN11         (uint32_t)(1U << 11U)    /*!< Enable the wakeup source IO11                   */
#define PWR_WAKEUP_PIN12         (uint32_t)(1U << 12U)    /*!< Enable the wakeup source IO12                   */
#define PWR_WAKEUP_PIN13         (uint32_t)(1U << 13U)    /*!< Enable the wakeup source IO13                   */
#define PWR_WAKEUP_PIN14         (uint32_t)(1U << 14U)    /*!< Enable the wakeup source IO14                   */
#define PWR_WAKEUP_PIN15         (uint32_t)(1U << 15U)    /*!< Enable the wakeup source IO15                   */

