stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_hal_pwr.h
#define PWR_WAKEUP_LPAWUR        PWR_IEWU_EWLPAWUR        /*!< Enable wakeup on LPAWUR RFIP event              */
#define PWR_WAKEUP_SUBG          PWR_IEWU_EWMRSUBG        /*!< Enable wakeup on MRSUBG RFIP event              */
#define PWR_WAKEUP_SUBGHOST      PWR_IEWU_EWMRSUBGHCPU    /*!< Enable wakeup on MRSUBG Host CPU event          */
#define PWR_WAKEUP_LCSC          PWR_IEWU_EIWL4           /*!< Enable wakeup on internal event (LCSC)          */
#define PWR_WAKEUP_COMP          PWR_IEWU_EIWL3           /*!< Enable wakeup on internal event (COMP)          */
#define PWR_WAKEUP_LCD           PWR_IEWU_EIWL2           /*!< Enable wakeup on internal event (LCD)           */
#define PWR_WAKEUP_RTC           PWR_IEWU_EIWL1           /*!< Enable wakeup on internal event (RTC)           */
#define PWR_WAKEUP_LPUART        PWR_IEWU_EIWL0           /*!< Enable wakeup on internal event (LPUART)        */

/**
  * @}
  */

/** @defgroup PWR_WAKEUP_SOURCE_PORT IO Port for wakeup source
  * @{
  */
#define PWR_WAKEUP_PORTA   (0x00000000U)       /*!< IO port A to get out from DEEPSTOP mode */
#define PWR_WAKEUP_PORTB   (0x00000001U)       /*!< IO port B to get out from DEEPSTOP mode */
/**
  * @}
  */

/** @defgroup PWR_WAKEUP_POLARITY IOs Wakeup configuration polarity
  * @{
  */
#define PWR_WUP_RISIEDG    (0x000000000U)
#define PWR_WUP_FALLEDG    (0x000000001U)
/**
  * @}
  */

/** @defgroup PWR_LOW_PWR_MODE Low Power mode selection
  * @{
  */
#define PWR_MODE_DEEPSTOP        (0x000000000U)
#define PWR_MODE_ULTRA_DEEPSTOP  (PWR_CR1_LPMS)
#define PWR_MODE_SHUTDOWN        (PWR_CR1_LPMS)
/**
  * @}
  */

/** @defgroup PWR_DEEPSTOP_SLOW_CLOCK_CONFIG Slow clock configuration in DEEPSTOP mode
  * @{
  */
#define PWR_DEEPSTOP_WITH_SLOW_CLOCK_OFF  (0x00000000U)
#define PWR_DEEPSTOP_WITH_SLOW_CLOCK_ON   (0x00000001U)
/**
  * @}
  */

/**
  * @}
  */

/* Private define ------------------------------------------------------------*/
/* Exported macros -----------------------------------------------------------*/
/** @defgroup PWR_Exported_Macros  PWR Exported Macros
  * @{
  */
/** @brief  Check PWR flags are set or not.
  * @param  __FLAG__ : Specifies the flag to check.
  *                    This parameter can be one of the following values when available :
  *                    @arg @ref PWR_FLAG_LPUART      : LPUART Internal wakeup flag.
  *                                                     Indicates that a wakeup from LPUART occurred since last clear.
  *                    @arg @ref PWR_FLAG_RTC         : RTC Internal wakeup flag.
  *                                                     Indicates that a wakeup from RTC occurred since last clear.
  *                    @arg @ref PWR_FLAG_LCD         : LCD Internal wakeup flag.
  *                                                     Indicates that a wakeup from LCD occurred since last clear.
  *                    @arg @ref PWR_FLAG_COMP        : COMP Internal wakeup flag.
  *                                                     Indicates that a wakeup from COMP occurred since last clear.
  *                    @arg @ref PWR_FLAG_LCSC        : COMP Internal wakeup flag.
  *                                                     Indicates that a wakeup from COMP occurred since last clear.
  *                    @arg @ref PWR_FLAG_MRSUBG      : COMP Internal wakeup flag.
  *                                                     Indicates that a wakeup from COMP occurred since last clear.
  *                    @arg @ref PWR_FLAG_MRSUBGHCPU  : COMP Internal wakeup flag.
  *                                                     Indicates that a wakeup from COMP occurred since last clear.
  *                    @arg @ref PWR_FLAG_LPAWUR      : COMP Internal wakeup flag.
  *                                                     Indicates that a wakeup from COMP occurred since last clear.
  *                    @arg @ref PWR_FLAG_SMPSBYPR    : SMPS PRECHARGE mode status.
  *                                                     Indicates that the SMPS regulator is in PRECHARGE mode.
  *                    @arg @ref PWR_FLAG_SMPSENR     : SMPS RUN mode status.
  *                                                     Indicates that the SMPS regulator is in RUN mode.
  *                    @arg @ref PWR_FLAG_SMPSRDY     : SMPS ready status.
  *                                                     Indicates that the SMPS regulator is ready.
  *                    @arg @ref PWR_FLAG_REGLPS      : Low Power regulator ready status.
  *                                                     Indicates that the Low Power regulator is ready.
  *                    @arg @ref PWR_FLAG_REGMS       : Main regulator ready status.
  *                                                     Indicates that the Low Power regulator is ready.
  *                    @arg @ref PWR_FLAG_PVDO        : Power voltage Detector Output.
  *                                                     Indicates that the Low Power regulator is ready.
  *                    @arg @ref PWR_FLAG_WUFA0       : PA0 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA0 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA1       : PA1 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA1 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA2       : PA2 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA2 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA3       : PA3 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA3 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA4       : PA4 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA4 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA5       : PA5 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA5 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA6       : PA6 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA6 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA7       : PA7 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA7 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA8       : PA8 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA8 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA9       : PA9 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA9 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA10      : PA10 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA10 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA11      : PA11 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA11 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA12      : PA12 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA12 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA13      : PA13 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA13 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA14      : PA14 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA14 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA15      : PA15 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA15 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB0       : PB0 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB0 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB1       : PB1 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB1 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB2       : PB2 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB2 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB3       : PB3 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB3 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB4       : PB4 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB4 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB5       : PB5 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB5 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB6       : PB6 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB6 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB7       : PB7 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB7 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB8       : PB8 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB8 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB9       : PB9 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB9 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB10      : PB10 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB10 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB11      : PB11 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB11 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB12      : PB12 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB12 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB13      : PB13 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB13 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB14      : PB14 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB14 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB15      : PB15 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB15 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUF         : PB0 pin wakeup from shutdown flag
  *                                                     Indicates a shutdown wakeup from PB0 pin occurred.
  *                    @arg @ref PWR_FLAG_RFPHASEF    : RFPHASE Flag.
  *                                                     Indicates that the RF SUBGHz IP is awake and may require
  *                                                     a system attention.
  *                    @arg @ref PWR_FLAG_DEEPSTOPF   : System DEEPTSTOP Flag.
  *                                                     the device entered a DEEPSTOP mode.
  * @retval The state of __FLAG__ (TRUE or FALSE).
  */
#if defined(STM32WL3XX)
#define __HAL_PWR_GET_FLAG(__FLAG__)( \
                                      ((__FLAG__) == PWR_FLAG_LPUART)     ? (READ_BIT(PWR->IWUF, PWR_IWUF_IWUF0)         == \
                                                                             PWR_IWUF_IWUF0)        : \
                                      ((__FLAG__) == PWR_FLAG_RTC)        ? (READ_BIT(PWR->IWUF, PWR_IWUF_IWUF1)         == \
                                                                             PWR_IWUF_IWUF1)        : \
                                      ((__FLAG__) == PWR_FLAG_LCD)        ? (READ_BIT(PWR->IWUF, PWR_IWUF_IWUF2)         == \
                                                                             PWR_IWUF_IWUF2)        : \
                                      ((__FLAG__) == PWR_FLAG_COMP)       ? (READ_BIT(PWR->IWUF, PWR_IWUF_IWUF3)         == \
                                                                             PWR_IWUF_IWUF3)        : \
                                      ((__FLAG__) == PWR_FLAG_LCSC)       ? (READ_BIT(PWR->IWUF, PWR_IWUF_IWUF4)         == \
                                                                             PWR_IWUF_IWUF4)        : \
                                      ((__FLAG__) == PWR_FLAG_MRSUBG)     ? (READ_BIT(PWR->IWUF, PWR_IWUF_WMRSUBGF)      == \
                                                                             PWR_IWUF_WMRSUBGF)     : \
                                      ((__FLAG__) == PWR_FLAG_MRSUBGHCPU) ? (READ_BIT(PWR->IWUF, PWR_IWUF_WMRSUBGHCPUF)  == \
                                                                             PWR_IWUF_WMRSUBGHCPUF) : \
                                      ((__FLAG__) == PWR_FLAG_LPAWUR)     ? (READ_BIT(PWR->IWUF, PWR_IWUF_WLPAWURF)      == \
                                                                             PWR_IWUF_WLPAWURF)     : \
                                      ((__FLAG__) == PWR_FLAG_SMPSBYPR)   ? (READ_BIT(PWR->SR2,  PWR_SR2_SMPSBYPR)       == \
                                                                             PWR_SR2_SMPSBYPR)      : \
                                      ((__FLAG__) == PWR_FLAG_SMPSENR)    ? (READ_BIT(PWR->SR2,  PWR_SR2_SMPSENR)        == \
                                                                             PWR_SR2_SMPSENR)       : \
                                      ((__FLAG__) == PWR_FLAG_SMPSRDY)    ? (READ_BIT(PWR->SR2,  PWR_SR2_SMPSRDY)        == \
                                                                             PWR_SR2_SMPSRDY)       : \
                                      ((__FLAG__) == PWR_FLAG_REGLPS)     ? (READ_BIT(PWR->SR2,  PWR_SR2_REGLPS)         == \
                                                                             PWR_SR2_REGLPS)        : \
                                      ((__FLAG__) == PWR_FLAG_REGMS)      ? (READ_BIT(PWR->SR2,  PWR_SR2_REGMS)          == \
                                                                             PWR_SR2_REGMS)         : \
                                      ((__FLAG__) == PWR_FLAG_PVDO)       ? (READ_BIT(PWR->SR2,  PWR_SR2_PVDO)           == \
                                                                             PWR_SR2_PVDO)          : \
                                      ((__FLAG__) == PWR_FLAG_WUFA0)      ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF0)          == \
                                                                             PWR_WUFA_WUF0)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFA1)      ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF1)          == \
                                                                             PWR_WUFA_WUF1)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFA2)      ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF2)          == \
                                                                             PWR_WUFA_WUF2)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFA3)      ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF3)          == \
                                                                             PWR_WUFA_WUF3)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFA4)      ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF4)          == \
                                                                             PWR_WUFA_WUF4)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFA5)      ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF5)          == \
                                                                             PWR_WUFA_WUF5)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFA6)      ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF6)          == \
                                                                             PWR_WUFA_WUF6)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFA7)      ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF7)          == \
                                                                             PWR_WUFA_WUF7)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFA8)      ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF8)          == \
                                                                             PWR_WUFA_WUF8)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFA9)      ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF9)          == \
                                                                             PWR_WUFA_WUF9)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFA10)     ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF10)         == \
                                                                             PWR_WUFA_WUF10)        : \
                                      ((__FLAG__) == PWR_FLAG_WUFA11)     ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF11)         == \
                                                                             PWR_WUFA_WUF11)        : \
                                      ((__FLAG__) == PWR_FLAG_WUFA12)     ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF12)         == \
                                                                             PWR_WUFA_WUF12)        : \
                                      ((__FLAG__) == PWR_FLAG_WUFA13)     ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF13)         == \
                                                                             PWR_WUFA_WUF13)        : \
                                      ((__FLAG__) == PWR_FLAG_WUFA14)     ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF14)         == \
                                                                             PWR_WUFA_WUF14)        : \
                                      ((__FLAG__) == PWR_FLAG_WUFA15)     ? (READ_BIT(PWR->WUFA, PWR_WUFA_WUF15)         == \
                                                                             PWR_WUFA_WUF15)        : \
                                      ((__FLAG__) == PWR_FLAG_WUFB0)      ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF0)          == \
                                                                             PWR_WUFB_WUF0)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFB1)      ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF1)          == \
                                                                             PWR_WUFB_WUF1)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFB2)      ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF2)          == \
                                                                             PWR_WUFB_WUF2)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFB3)      ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF3)          == \
                                                                             PWR_WUFB_WUF3)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFB4)      ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF4)          == \
                                                                             PWR_WUFB_WUF4)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFB5)      ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF5)          == \
                                                                             PWR_WUFB_WUF5)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFB6)      ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF6)          == \
                                                                             PWR_WUFB_WUF6)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFB7)      ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF7)          == \
                                                                             PWR_WUFB_WUF7)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFB8)      ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF8)          == \
                                                                             PWR_WUFB_WUF8)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFB9)      ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF9)          == \
                                                                             PWR_WUFB_WUF9)         : \
                                      ((__FLAG__) == PWR_FLAG_WUFB10)     ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF10)         == \
                                                                             PWR_WUFB_WUF10)        : \
                                      ((__FLAG__) == PWR_FLAG_WUFB11)     ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF11)         == \
                                                                             PWR_WUFB_WUF11)        : \
                                      ((__FLAG__) == PWR_FLAG_WUFB12)     ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF12)         == \
                                                                             PWR_WUFB_WUF12)        : \
                                      ((__FLAG__) == PWR_FLAG_WUFB13)     ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF13)         == \
                                                                             PWR_WUFB_WUF13)        : \
                                      ((__FLAG__) == PWR_FLAG_WUFB14)     ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF14)         == \
                                                                             PWR_WUFB_WUF14)        : \
                                      ((__FLAG__) == PWR_FLAG_WUFB15)     ? (READ_BIT(PWR->WUFB, PWR_WUFB_WUF15)         == \
                                                                             PWR_WUFB_WUF15)        : \
                                      ((__FLAG__) == PWR_FLAG_WUF)        ? (READ_BIT(PWR->SDWN_WUF, PWR_SDWN_WUF_WUF)   == \
                                                                             PWR_SDWN_WUF_WUF)      : \
                                      ((__FLAG__) == PWR_FLAG_DEEPSTOPF)  ? (READ_BIT(PWR->EXTSRR, PWR_EXTSRR_DEEPSTOPF) == \
                                                                             PWR_EXTSRR_DEEPSTOPF)  : \
                                      (READ_BIT(PWR->EXTSRR, PWR_EXTSRR_RFPHASEF)  == PWR_EXTSRR_RFPHASEF))
#else
#define __HAL_PWR_GET_FLAG(__FLAG__)( \
                                      ((__FLAG__) == PWR_FLAG_LPUART)     ? (READ_BIT(PWR->IWUF, PWR_IWUF_IWUF0)         == \
                                                                             PWR_IWUF_IWUF0)        : \
                                      ((__FLAG__) == PWR_FLAG_RTC)        ? (READ_BIT(PWR->IWUF, PWR_IWUF_IWUF1)         == \
                                                                             PWR_IWUF_IWUF1)        : \
                                      ((__FLAG__) == PWR_FLAG_LCD)        ? (READ_BIT(PWR->IWUF, PWR_IWUF_IWUF2)         == \
                                                                             PWR_IWUF_IWUF2)        : \
