stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_hal_pwr.h
/** @brief  Clear PWR flags.
  * @param  __FLAG__ : Specifies the flag to clear.
  *                    This parameter can be one of the following values when available :
  *                    @arg @ref PWR_FLAG_LPUART      : LPUART Internal wakeup flag.
  *                                                     Indicates that a wakeup from LPUART occurred since last clear.
  *                    @arg @ref PWR_FLAG_RTC         : RTC Internal wakeup flag.
  *                                                     Indicates that a wakeup from RTC occurred since last clear.
  *                    @arg @ref PWR_FLAG_LCD         : LCD Internal wakeup flag.
  *                                                     Indicates that a wakeup from LCD occurred since last clear.
  *                    @arg @ref PWR_FLAG_COMP        : COMP Internal wakeup flag.
  *                                                     Indicates that a wakeup from COMP occurred since last clear.
  *                    @arg @ref PWR_FLAG_LCSC        : COMP Internal wakeup flag.
  *                                                     Indicates that a wakeup from COMP occurred since last clear.
  *                    @arg @ref PWR_FLAG_MRSUBG      : COMP Internal wakeup flag.
  *                                                     Indicates that a wakeup from COMP occurred since last clear.
  *                    @arg @ref PWR_FLAG_MRSUBGHCPU  : COMP Internal wakeup flag.
  *                                                     Indicates that a wakeup from COMP occurred since last clear.
  *                    @arg @ref PWR_FLAG_LPAWUR      : COMP Internal wakeup flag.
  *                                                     Indicates that a wakeup from COMP occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA0       : PA0 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA0 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA1       : PA1 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA1 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA2       : PA2 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA2 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA3       : PA3 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA3 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA4       : PA4 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA4 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA5       : PA5 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA5 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA6       : PA6 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA6 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA7       : PA7 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA7 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA8       : PA8 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA8 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA9       : PA9 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA9 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA10      : PA10 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA10 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA11      : PA11 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA11 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA12      : PA12 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA12 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA13      : PA13 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA13 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA14      : PA14 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA14 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFA15      : PA15 pin wakeup flag.
  *                                                     Indicates that a wakeup from PA15 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB0       : PB0 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB0 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB1       : PB1 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB1 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB2       : PB2 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB2 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB3       : PB3 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB3 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB4       : PB4 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB4 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB5       : PB5 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB5 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB6       : PB6 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB6 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB7       : PB7 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB7 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB8       : PB8 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB8 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB9       : PB9 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB9 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB10      : PB10 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB10 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB11      : PB11 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB11 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB12      : PB12 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB12 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB13      : PB13 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB13 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB14      : PB14 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB14 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUFB15      : PB15 pin wakeup flag.
  *                                                     Indicates that a wakeup from PB15 pin occurred since last clear.
  *                    @arg @ref PWR_FLAG_WUF         : PB0 pin wakeup from shutdown flag
  *                                                     Indicates a shutdown wakeup from PB0 pin occurred..
  *                    @arg @ref PWR_FLAG_RFPHASEF    : RFPHASE Flag.
  *                                                     Indicates that the RF SUBGHz IP is awake and may require
  *                                                     a system attention.
  *                    @arg @ref PWR_FLAG_DEEPSTOPF   : System DEEPTSTOP Flag.
  *                                                     Indicates that the device entered a DEEPSTOP mode.
  * @retval None.
  */
#if defined(STM32WL3XX)
#define __HAL_PWR_CLEAR_FLAG(__FLAG__)( \
                                        ((__FLAG__) == PWR_FLAG_LPUART)     ? (SET_BIT(PWR->IWUF, PWR_IWUF_IWUF0))         : \
                                        ((__FLAG__) == PWR_FLAG_RTC)        ? (SET_BIT(PWR->IWUF, PWR_IWUF_IWUF1))         : \
                                        ((__FLAG__) == PWR_FLAG_LCD)        ? (SET_BIT(PWR->IWUF, PWR_IWUF_IWUF2))         : \
                                        ((__FLAG__) == PWR_FLAG_COMP)       ? (SET_BIT(PWR->IWUF, PWR_IWUF_IWUF3))         : \
                                        ((__FLAG__) == PWR_FLAG_LCSC)       ? (SET_BIT(PWR->IWUF, PWR_IWUF_IWUF4))         : \
                                        ((__FLAG__) == PWR_FLAG_MRSUBG)     ? (SET_BIT(PWR->IWUF, PWR_IWUF_WMRSUBGF))      : \
                                        ((__FLAG__) == PWR_FLAG_MRSUBGHCPU) ? (SET_BIT(PWR->IWUF, PWR_IWUF_WMRSUBGHCPUF))  : \
                                        ((__FLAG__) == PWR_FLAG_LPAWUR)     ? (SET_BIT(PWR->IWUF, PWR_IWUF_WLPAWURF))      : \
                                        ((__FLAG__) == PWR_FLAG_WUFA0)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF0))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA1)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF1))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA2)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF2))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA3)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF3))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA4)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF4))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA5)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF5))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA6)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF6))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA7)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF7))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA8)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF8))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA9)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF9))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA10)     ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF10))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFA11)     ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF11))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFA12)     ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF12))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFA13)     ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF13))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFA14)     ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF14))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFA15)     ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF15))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFB0)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF0))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB1)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF1))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB2)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF2))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB3)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF3))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB4)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF4))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB5)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF5))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB6)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF6))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB7)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF7))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB8)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF8))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB9)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF9))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB10)     ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF10))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFB11)     ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF11))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFB12)     ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF12))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFB13)     ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF13))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFB14)     ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF14))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFB15)     ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF15))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF)        ? (CLEAR_BIT(PWR->SDWN_WUF, PWR_SDWN_WUF_WUF)) : \
                                        ((__FLAG__) == PWR_FLAG_DEEPSTOPF)  ? (SET_BIT(PWR->EXTSRR, PWR_EXTSRR_DEEPSTOPF)) : \
                                        (SET_BIT(PWR->EXTSRR, PWR_EXTSRR_RFPHASEF)))
#else
#define __HAL_PWR_CLEAR_FLAG(__FLAG__)( \
                                        ((__FLAG__) == PWR_FLAG_LPUART)     ? (SET_BIT(PWR->IWUF, PWR_IWUF_IWUF0))         : \
                                        ((__FLAG__) == PWR_FLAG_RTC)        ? (SET_BIT(PWR->IWUF, PWR_IWUF_IWUF1))         : \
                                        ((__FLAG__) == PWR_FLAG_LCD)        ? (SET_BIT(PWR->IWUF, PWR_IWUF_IWUF2))         : \
                                        ((__FLAG__) == PWR_FLAG_COMP)       ? (SET_BIT(PWR->IWUF, PWR_IWUF_IWUF3))         : \
                                        ((__FLAG__) == PWR_FLAG_LCSC)       ? (SET_BIT(PWR->IWUF, PWR_IWUF_IWUF4))         : \
                                        ((__FLAG__) == PWR_FLAG_MRSUBG)     ? (SET_BIT(PWR->IWUF, PWR_IWUF_WMRSUBGF))      : \
                                        ((__FLAG__) == PWR_FLAG_MRSUBGHCPU) ? (SET_BIT(PWR->IWUF, PWR_IWUF_WMRSUBGHCPUF))  : \
                                        ((__FLAG__) == PWR_FLAG_WUFA0)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF0))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA1)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF1))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA2)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF2))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA3)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF3))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA4)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF4))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA5)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF5))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA6)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF6))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA7)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF7))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA8)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF8))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA9)      ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF9))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFA10)     ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF10))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFA11)     ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF11))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFA12)     ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF12))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFA13)     ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF13))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFA14)     ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF14))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFA15)     ? (SET_BIT(PWR->WUFA, PWR_WUFA_WUF15))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFB0)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF0))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB1)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF1))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB2)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF2))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB3)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF3))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB4)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF4))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB5)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF5))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB6)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF6))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB7)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF7))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB8)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF8))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB9)      ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF9))          : \
                                        ((__FLAG__) == PWR_FLAG_WUFB10)     ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF10))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFB11)     ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF11))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFB12)     ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF12))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFB13)     ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF13))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFB14)     ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF14))         : \
                                        ((__FLAG__) == PWR_FLAG_WUFB15)     ? (SET_BIT(PWR->WUFB, PWR_WUFB_WUF15))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF)        ? (CLEAR_BIT(PWR->SDWN_WUF, PWR_SDWN_WUF_WUF)) : \
                                        ((__FLAG__) == PWR_FLAG_DEEPSTOPF)  ? (SET_BIT(PWR->EXTSRR, PWR_EXTSRR_DEEPSTOPF)) : \
                                        (SET_BIT(PWR->EXTSRR, PWR_EXTSRR_RFPHASEF)))
#endif /* STM32WL3XX*/

/**
  * @brief Enable the PVD Line.
  * @retval None
  */
#define __HAL_PWR_PVD_ENABLE_IT()   SET_BIT(SYSCFG->PWRC_IER, SYSCFG_PWRC_IER_PVD_IE)

/**
  * @brief Disable the PVD Interrupt Line.
  * @retval None
  */
#define __HAL_PWR_PVD_DISABLE_IT()  CLEAR_BIT(SYSCFG->PWRC_IER, SYSCFG_PWRC_IER_PVD_IE)


/**
  * @brief Check whether or not the PVD interrupt flag is set.
  * @retval PVD Line Status.
  */
#define __HAL_PWR_PVD_GET_FLAG()  (READ_BIT(SYSCFG->PWRC_ISCR, SYSCFG_PWRC_ISCR_PVD_ISC)\
                                   == (SYSCFG_PWRC_ISCR_PVD_ISC)) ? 1UL : 0U

/**
  * @brief Clear the PVD interrupt flag.
  * @retval None
  */
#define __HAL_PWR_PVD_CLEAR_FLAG()  WRITE_REG(SYSCFG->PWRC_ISCR, SYSCFG_PWRC_ISCR_PVD_ISC)

/**
  * @brief Check if the wake up from SHUTWDOWN happens or not.
  * @retval None
  * @note For STM32WL3RX device the wakeup from shutdown mode happens
          from the following pins: PB0, PA0, PA7, PA8, PA9, and PA11.
  * @note For STM32WL3XX device The wakeup from shutdown mode happens
          from PB0 pin.
  */
#define __HAL_PWR_IO_WAKEUP_SHUTDOWN_GET_FLAG()  LL_PWR_IsIOWakeupSDN()

/**
  * @brief Check if the wake up from SHUTWDOWN happens or not.
  * @retval None
  * @note For STM32WL3RX device the wakeup from shutdown mode happens
          from the following pins: PB0, PA0, PA7, PA8, PA9, and PA11.
  * @note For STM32WL3XX device The wakeup from shutdown mode happens
          from PB0 pin.
  */
#define __HAL_PWR_CLEAR_IO_WAKEUP_SHUTDOWN_FLAG()  LL_PWR_ClearIOWakeupFlagSDN()

/**
  * @brief Check if the wake up from ULTRA_DEEPSTOP happens or not.
  * @retval None
    @note The ULTRA_DEEPSTOP mode is available only for STM32WL3RX device.
  * @note The wakeup from ultra-deepstop mode happens from the following
          pins: PB0, PA0, PA7, PA8, PA9, and PA11.
  */
#define __HAL_PWR_IO_WAKEUP_ULTRA_DEEPSTOP_GET_FLAG()  LL_PWR_IsIOWakeupSDN()

/**
  * @brief Check if the wake up from ULTRA_DEEPSTOP happens or not.
  * @retval None
    @note The ULTRA_DEEPSTOP mode is available only for STM32WL3RX device.
  * @note The wakeup from ultra-deepstop mode happens from the following
          pins: PB0, PA0, PA7, PA8, PA9, and PA11.
  */
#define __HAL_PWR_CLEAR_IO_WAKEUP_ULTRA_DEEPSTOP_FLAG()  LL_PWR_ClearIOWakeupFlagSDN()

/**
  * @}
  */


