stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_hal_pwr.h
/* Private macros --------------------------------------------------------*/
/** @defgroup PWR_Private_Macros  PWR Private Macros
  * @{
  */

#define IS_PWR_PVD_LEVEL(LEVEL) (((LEVEL) == PWR_PVDLEVEL_0) || ((LEVEL) == PWR_PVDLEVEL_1)|| \
                                 ((LEVEL) == PWR_PVDLEVEL_2) || ((LEVEL) == PWR_PVDLEVEL_3)|| \
                                 ((LEVEL) == PWR_PVDLEVEL_4) || ((LEVEL) == PWR_PVDLEVEL_5)|| \
                                 ((LEVEL) == PWR_PVDLEVEL_6) || ((LEVEL) == PWR_PVDLEVEL_7))


#define IS_PWR_PVD_MODE(MODE)  (((MODE) == PWR_PVD_MODE_NORMAL)||\
                                ((MODE) == PWR_PVD_MODE_IT))

#if defined(STM32WL3XX)
#define IS_PWR_WAKEUP_SOURCE(PIN) (((PIN) == PWR_WAKEUP_ALL)       ||\
                                   ((PIN) == PWR_WAKEUP_PIN0 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN1 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN2 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN3 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN4 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN5 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN6 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN7 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN8 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN9 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN10)     ||\
                                   ((PIN) == PWR_WAKEUP_PIN11)     ||\
                                   ((PIN) == PWR_WAKEUP_PIN12)     ||\
                                   ((PIN) == PWR_WAKEUP_PIN13)     ||\
                                   ((PIN) == PWR_WAKEUP_PIN14)     ||\
                                   ((PIN) == PWR_WAKEUP_PIN15)     ||\
                                   ((PIN) == PWR_WAKEUP_LPAWUR)    ||\
                                   ((PIN) == PWR_WAKEUP_SUBG)      ||\
                                   ((PIN) == PWR_WAKEUP_SUBGHOST)  ||\
                                   ((PIN) == PWR_WAKEUP_LCSC)      ||\
                                   ((PIN) == PWR_WAKEUP_COMP)      ||\
                                   ((PIN) == PWR_WAKEUP_LCD)       ||\
                                   ((PIN) == PWR_WAKEUP_RTC)       ||\
                                   ((PIN) == PWR_WAKEUP_LPUART))
#else
#define IS_PWR_WAKEUP_SOURCE(PIN) (((PIN) == PWR_WAKEUP_ALL)       ||\
                                   ((PIN) == PWR_WAKEUP_PIN0 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN1 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN2 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN3 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN4 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN5 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN6 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN7 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN8 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN9 )     ||\
                                   ((PIN) == PWR_WAKEUP_PIN10)     ||\
                                   ((PIN) == PWR_WAKEUP_PIN11)     ||\
                                   ((PIN) == PWR_WAKEUP_PIN12)     ||\
                                   ((PIN) == PWR_WAKEUP_PIN13)     ||\
                                   ((PIN) == PWR_WAKEUP_PIN14)     ||\
                                   ((PIN) == PWR_WAKEUP_PIN15)     ||\
                                   ((PIN) == PWR_WAKEUP_SUBG)      ||\
                                   ((PIN) == PWR_WAKEUP_SUBGHOST)  ||\
                                   ((PIN) == PWR_WAKEUP_RTC)       ||\
                                   ((PIN) == PWR_WAKEUP_LPUART))
#endif /* (STM32WL3XX) */

#define IS_PWR_WAKEUP_POLARITY(POL)  (((POL) == PWR_WUP_RISIEDG) ||\
                                      ((POL) == PWR_WUP_FALLEDG))

/**
  * @}
  */

/* Include PWR HAL Extended module */
#include "stm32wl3x_hal_pwr_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @defgroup PWR_Exported_Functions  PWR Exported Functions
  * @{
  */

/* Programmable voltage detector functions  ***********************************/
HAL_StatusTypeDef HAL_PWR_ConfigPVD(PWR_PVDTypeDef *sConfigPVD);
void              HAL_PWR_EnablePVD(void);
void              HAL_PWR_DisablePVD(void);
void              HAL_PWR_PVDCallback(void);

/* Wake up pins configuration functions ***************************************/
void HAL_PWR_EnableWakeUpPin(uint32_t WakeUpPort, uint32_t WakeUpPin, uint32_t WakeUpPolarity);
void HAL_PWR_DisableWakeUpPin(uint32_t WakeUpPort, uint32_t WakeUpPin);
uint32_t HAL_PWR_GetClearWakeupSource(uint32_t WakeUpPort);

/* Low power modes configuration functions ************************************/
HAL_StatusTypeDef HAL_PWR_ConfigDEEPSTOP(PWR_DEEPSTOPTypeDef *sConfigDEEPSTOP);
HAL_StatusTypeDef HAL_PWR_ConfigSHUTDOWN(PWR_SHUTDOWNTypeDef *sConfigSHUTDOWN);
HAL_StatusTypeDef HAL_PWR_ConfigUltraDeepStop(PWR_ULTRA_DEEPSTOPTypeDef *sConfigUltraDeepStop);
void HAL_PWR_EnterSLEEPMode(void);
void HAL_PWR_EnterDEEPSTOPMode(void);
void HAL_PWR_EnterUltraDeepStopMode(void);


/* Sleep on exit and sev on pending configuration functions *******************/
void HAL_PWR_EnableSleepOnExit(void);
void HAL_PWR_DisableSleepOnExit(void);
void HAL_PWR_EnableSEVOnPend(void);
void HAL_PWR_DisableSEVOnPend(void);

/* Interrupt handler functions ************************************************/
void HAL_PWR_PVD_IRQHandler(void);
void HAL_PWR_WKUP_IRQHandler(void);
void HAL_PWR_WKUPx_Callback(uint32_t wakeupPort, uint32_t wakeupIOs);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif


#endif /* STM32WL3x_HAL_PWR_H */
